name: "core"
platform: "pytorch_libtorch" 

input [
    {
        name: "INPUT__0"
        data_type: TYPE_FP32 
        dims: [-1, 3, -1, -1]
    }
] 

output [
    {
        name: "OUTPUT__0"
        data_type: TYPE_FP32 
        dims: [-1, -1]
    }
]